In [1]:
import pandas as pd
import numpy as np

In [3]:
#fill the Dataframe
ave_data = np.array(np.arange(24)).reshape((6,4))#use numpy to create 2-level list ad fill it
dates = pd.date_range('20230101',periods=6)#create dates for our indexes start from 1st January 2023
ave_df = pd.DataFrame(ave_data, index=dates, columns=list('1234'))#create Table with pandas DataFrame,
ave_df#print  table

             1   2   3   4
2023-01-01   0   1   2   3
2023-01-02   4   5   6   7
2023-01-03   8   9  10  11
2023-01-04  12  13  14  15
2023-01-05  16  17  18  19
2023-01-06  20  21  22  23

In [4]:
#print column with name '4'
ave_df['4']

2023-01-01     3
2023-01-02     7
2023-01-03    11
2023-01-04    15
2023-01-05    19
2023-01-06    23
Freq: D, Name: 4, dtype: int32

In [5]:
#slice our table by rows
ave_df[1:3]

            1  2   3   4
2023-01-02  4  5   6   7
2023-01-03  8  9  10  11

In [6]:
#slice our table by indexes with dates
ave_df['2023-01-01':'2023-01-03']

            1  2   3   4
2023-01-01  0  1   2   3
2023-01-02  4  5   6   7
2023-01-03  8  9  10  11

In [8]:
#slice with loc parameter
ave_df.loc[dates[1:5]]

             1   2   3   4
2023-01-02   4   5   6   7
2023-01-03   8   9  10  11
2023-01-04  12  13  14  15
2023-01-05  16  17  18  19

In [10]:
#print all data from 2 and 4 columns
ave_df.loc[:,['2', '3']]

             2   3
2023-01-01   1   2
2023-01-02   5   6
2023-01-03   9  10
2023-01-04  13  14
2023-01-05  17  18
2023-01-06  21  22

In [12]:
#print all data from 2 and 4 columns and need dates
ave_df.loc['2023-01-01':'2023-01-05',['2', '3']]

             2   3
2023-01-01   1   2
2023-01-02   5   6
2023-01-03   9  10
2023-01-04  13  14
2023-01-05  17  18

In [14]:
#print with arithmetic
ave_df.loc['2023-01-01',['2', '3']] [1] * 5 #value with index 1 will be * 5

10

In [15]:
ave_df.loc[dates[1], '1']

4

In [16]:
ave_data[2]

array([ 8,  9, 10, 11])

In [17]:
ave_df.iloc[2]#iloc - index_location

1     8
2     9
3    10
4    11
Name: 2023-01-03 00:00:00, dtype: int32

In [19]:
ave_df.iloc[1:3,0:2]

            1  2
2023-01-02  4  5
2023-01-03  8  9

In [20]:
ave_df.iloc[[0,1,3],[0,2]]

             1   3
2023-01-01   0   2
2023-01-02   4   6
2023-01-04  12  14

In [21]:
ave_df.iloc[[0,1,3],:]

             1   2   3   4
2023-01-01   0   1   2   3
2023-01-02   4   5   6   7
2023-01-04  12  13  14  15

In [22]:
ave_df.iloc[:,[0,2]]

             1   3
2023-01-01   0   2
2023-01-02   4   6
2023-01-03   8  10
2023-01-04  12  14
2023-01-05  16  18
2023-01-06  20  22

In [23]:
ave_df[ave_df >= 5]

               1     2     3     4
2023-01-01   NaN   NaN   NaN   NaN
2023-01-02   NaN   5.0   6.0   7.0
2023-01-03   8.0   9.0  10.0  11.0
2023-01-04  12.0  13.0  14.0  15.0
2023-01-05  16.0  17.0  18.0  19.0
2023-01-06  20.0  21.0  22.0  23.0